ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_gpio_data_regs.xml
	<register id="GPBSET" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="GPIO B Data Set Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Output Set bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO36" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Output Set bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO38" description="Output Set bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Output Set bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Output Set bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Output Set bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Output Set bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Output Set bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Output Set bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Output Set bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Output Set bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Output Set bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Output Set bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Output Set bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Output Set bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Output Set bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Output Set bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Output Set bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Output Set bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Output Set bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Output Set bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Output Set bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Output Set bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Output Set bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO60" description="Output Set bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Output Set bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Output Set bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Output Set bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBCLEAR" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="GPIO B Data Clear Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Output Clear bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO36" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Output Clear bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO38" description="Output Clear bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Output Clear bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Output Clear bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Output Clear bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Output Clear bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Output Clear bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Output Clear bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Output Clear bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Output Clear bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Output Clear bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Output Clear bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Output Clear bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Output Clear bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Output Clear bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Output Clear bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Output Clear bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Output Clear bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Output Clear bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Output Clear bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Output Clear bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Output Clear bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Output Clear bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO60" description="Output Clear bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Output Clear bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Output Clear bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Output Clear bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBTOGGLE" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="GPIO B Data Toggle Register (GPIO32 to 63) ">
		<bitfield id="GPIO32" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Output Toggle bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Output Toggle bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO36" description="Output Toggle bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Output Toggle bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO38" description="Output Toggle bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Output Toggle bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Output Toggle bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Output Toggle bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Output Toggle bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Output Toggle bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Output Toggle bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Output Toggle bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Output Toggle bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Output Toggle bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Output Toggle bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Output Toggle bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Output Toggle bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Output Toggle bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Output Toggle bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Output Toggle bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Output Toggle bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Output Toggle bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Output Toggle bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Output Toggle bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Output Toggle bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Output Toggle bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO60" description="Output Toggle bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Output Toggle bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Output Toggle bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Output Toggle bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
