ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_gpio_data_regs.xml
	<register id="GPBDIR" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="GPIO B Direction Register (GPIO0 to 31)">
		<bitfield id="GPIO32" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO36" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO38" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="Defines direction for this pin in GPIO mode" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="Defines direction for this pin in GPIO mode" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="Defines direction for this pin in GPIO mode" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="Defines direction for this pin in GPIO mode" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO60" description="Defines direction for this pin in GPIO mode" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Defines direction for this pin in GPIO mode" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Defines direction for this pin in GPIO mode" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCDAT" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="GPIO C Data Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Data Register for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Data Register for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Data Register for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Data Register for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Data Register for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Data Register for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Data Register for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Data Register for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Data Register for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Data Register for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Data Register for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Data Register for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Data Register for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Data Register for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Data Register for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Data Register for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Data Register for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Data Register for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Data Register for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Data Register for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Data Register for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Data Register for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCSET" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="GPIO C Data Set Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Output Set bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Output Set bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Output Set bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Output Set bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Output Set bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Output Set bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Output Set bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Output Set bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Output Set bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Output Set bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Output Set bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Output Set bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Output Set bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Output Set bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Output Set bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Output Set bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Output Set bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Output Set bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Output Set bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Output Set bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Output Set bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Output Set bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Output Set bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Output Set bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Output Set bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Output Set bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Output Set bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Output Set bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCCLEAR" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="GPIO C Data Clear Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Output Clear bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Output Clear bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Output Clear bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Output Clear bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Output Clear bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Output Clear bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Output Clear bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Output Clear bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Output Clear bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Output Clear bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Output Clear bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Output Clear bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Output Clear bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Output Clear bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Output Clear bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Output Clear bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Output Clear bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Output Clear bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Output Clear bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Output Clear bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Output Clear bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Output Clear bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Output Clear bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Output Clear bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Output Clear bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Output Clear bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Output Clear bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Output Clear bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
