ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_gpio_data_regs.xml
	<register id="GPCTOGGLE" width="32" page="0" offset="0x34" instances="1" instaddr="4" internal="0" description="GPIO C Data Toggle Register (GPIO64 to 95) ">
		<bitfield id="GPIO64" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Output Toggle bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Output Toggle bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Output Toggle bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Output Toggle bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Output Toggle bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Output Toggle bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Output Toggle bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Output Toggle bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Output Toggle bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Output Toggle bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Output Toggle bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Output Toggle bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Output Toggle bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Output Toggle bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Output Toggle bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Output Toggle bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Output Toggle bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Output Toggle bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Output Toggle bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Output Toggle bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Output Toggle bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Output Toggle bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Output Toggle bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Output Toggle bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Output Toggle bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Output Toggle bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Output Toggle bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Output Toggle bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Output Toggle bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Output Toggle bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCDIR" width="32" page="0" offset="0x38" instances="1" instaddr="4" internal="0" description="GPIO C Direction Register (GPIO0 to 31)">
		<bitfield id="GPIO64" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Defines direction for this pin in GPIO mode" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Defines direction for this pin in GPIO mode" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Defines direction for this pin in GPIO mode" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Defines direction for this pin in GPIO mode" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Defines direction for this pin in GPIO mode" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Defines direction for this pin in GPIO mode" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Defines direction for this pin in GPIO mode" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
