ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_gpio_data_regs.xml
	<register id="GPDDAT" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="GPIO D Data Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Data Register for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDSET" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="GPIO D Data Set Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Output Set bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Output Set bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Output Set bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Output Set bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Output Set bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDCLEAR" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="GPIO D Data Clear Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Output Clear bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Output Clear bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Output Clear bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Output Clear bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Output Clear bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDTOGGLE" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="GPIO D Data Toggle Register (GPIO96 to 127) ">
		<bitfield id="GPIO96" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Output Toggle bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Output Toggle bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Output Toggle bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Output Toggle bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Output Toggle bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Output Toggle bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Output Toggle bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDDIR" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="GPIO D Direction Register (GPIO0 to 31)">
		<bitfield id="GPIO96" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
