ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_gpio_data_regs.xml
	<register id="GPFDAT" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="GPIO F Data Register (GPIO160 to 191)">
		<bitfield id="GPIO160" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO169" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO170" description="Data Register for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO171" description="Data Register for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO172" description="Data Register for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO173" description="Data Register for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO174" description="Data Register for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO175" description="Data Register for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO176" description="Data Register for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO177" description="Data Register for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO178" description="Data Register for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO179" description="Data Register for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO180" description="Data Register for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO181" description="Data Register for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO182" description="Data Register for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO183" description="Data Register for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO184" description="Data Register for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO185" description="Data Register for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO186" description="Data Register for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO187" description="Data Register for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO188" description="Data Register for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO189" description="Data Register for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO190" description="Data Register for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO191" description="Data Register for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGDAT" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="GPIO G Data Register (GPIO192 to 223)">
		<bitfield id="GPIO192" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO193" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO194" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO195" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO196" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO197" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO198" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Data Register for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Data Register for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Data Register for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Data Register for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Data Register for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Data Register for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Data Register for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Data Register for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Data Register for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Data Register for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Data Register for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Data Register for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Data Register for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Data Register for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Data Register for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Data Register for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Data Register for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGSET" width="32" page="0" offset="0x7c" instances="1" instaddr="4" internal="0" description="GPIO G Data Set Register (GPIO192 to 223)">
		<bitfield id="GPIO219" description="Output Set bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Output Set bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Output Set bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Output Set bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Output Set bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
